#
# The contents of this file are subject to the terms of the Common Development and
# Distribution License (the License). You may not use this file except in compliance with the
# License.
#
# You can obtain a copy of the License at legal/CDDLv1.0.txt. See the License for the
# specific language governing permission and limitations under the License.
#
# When distributing Covered Software, include this CDDL Header Notice in each file and include
# the License file at legal/CDDLv1.0.txt. If applicable, add the following below the CDDL
# Header, with the fields enclosed by brackets [] replaced by your own identifying
# information: "Portions copyright [year] [name of copyright owner]".
#
# Copyright 2019 Open Source Solution Technology Corporation
#

authentication=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb

# module descriptor (shows up on OpenAM Console)
iplanet-am-auth-Webauthn-Register-service-description=WebAuthn (\u767b\u9332)

# localization for module configuration
a615=\u8a8d\u8a3c\u30ec\u30d9\u30eb
a615.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a615.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
0(\u30c7\u30d5\u30a9\u30eb\u30c8)\u304c\u6700\u4f4e\u3067\u3059\u3002
a616=RP\u540d
a616.help=RP\u540d\u8a2d\u5b9a
a616.help.txt=RP\u540d\u306f\u30e6\u30fc\u30b6\u30fc\u306bRP\u30b5\u30fc\u30d0\u30fc\u3092\u8b58\u5225\u3055\u305b\u308b\u4efb\u610f\u306e\u6587\u5b57\u5217\u3067\u3059\u3002
a617=Origin
a617.help=RP\u30b5\u30fc\u30d0\u30fc\u306eOrigin\u8a2d\u5b9a
a617.help.txt=RP\u30b5\u30fc\u30d0\u30fc\u306eOrigin\u3092\u30d7\u30ed\u30c8\u30b3\u30eb://FQDN:\u30dd\u30fc\u30c8\u306e\u5f62\u3067\u8a18\u8ff0\u3057\u307e\u3059\u3002\u4f8b https://openam.example.com:443
a618=Attestation\u8a2d\u5b9a
a618.help=Attestation\u8a2d\u5b9a
a618.help.txt=\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u56fa\u6709\u60c5\u5831\u306e\u53d6\u5f97\u65b9\u6cd5\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002none\u306e\u5834\u5408\u306f\u30c7\u30d0\u30a4\u30b9\u56fa\u6709\u60c5\u5831\u3092\u6271\u3044\u307e\u305b\u3093\u3002
a619=Attachiment\u8a2d\u5b9a
a619.help=Attachment\u8a2d\u5b9a
a619.help.txt=\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u306e\u7a2e\u985e\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002platform\u306f\u6a5f\u5668\u5185\u8535\u30c7\u30d0\u30a4\u30b9(TPM\u7b49)\u3092\u3001\
cross-platform\u306fUSB\u30ad\u30fc\u306a\u3069\u306e\u5916\u90e8\u30c7\u30d0\u30a4\u30b9\u3092\u8981\u6c42\u3057\u307e\u3059\u3002\
undefined\u3092\u6307\u5b9a\u3059\u308b\u3068platform\u304b\u3089\u63a2\u3057\u3001\u6a5f\u5668\u304c\u7121\u3044\u304b\u30ad\u30e3\u30f3\u30bb\u30eb\u3059\u308b\u3068cross-platform\u306b\u306a\u308b\u3002
a620=Resident Key\u8a2d\u5b9a
a620.help=Resident Key\u8a2d\u5b9a
a620.help.txt=WebAuthn\u8a8d\u8a3c\u958b\u59cb\u6642\u306b\u30e6\u30fc\u30b6\u30fc\u540d\u3092\u5165\u529b\u3059\u308b\u3053\u3068\u7121\u3057\u306b\u30ed\u30b0\u30a4\u30f3\u30dc\u30bf\u30f3\u3092\u62bc\u3059\u3060\u3051\u3067\u8a8d\u8a3c\u958b\u59cb\u3067\u304d\u308b\u30ed\u30b0\u30a4\u30f3\u753b\u9762\u304c\u8868\u793a\u3055\u308c\u307e\u3059\u3002\
\u5229\u7528\u3059\u308b\u306b\u306f\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u304cresidentikey=true\u3067\u767b\u9332\u3055\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a621=\u30ed\u30fc\u30ab\u30eb\u8a8d\u8a3c\u8a2d\u5b9a
a621.help=\u30ed\u30fc\u30ab\u30eb\u8a8d\u8a3c(user verification)\u8a2d\u5b9a
a621.help.txt=\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u306e\u64cd\u4f5c\u3092\u884c\u3046\u969b\u306b\u3001\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u72ec\u81ea\u306e\u8a8d\u8a3c\u3092\u8981\u6c42\u3059\u308b\u304b\u3069\u3046\u304b\u6307\u5b9a\u3057\u307e\u3059\u3002\
required\u3092\u8a2d\u5b9a\u3057\u305f\u5834\u5408\u3001\u30ed\u30fc\u30ab\u30eb\u8a8d\u8a3c\u6a5f\u80fd\u304c\u306a\u3044\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u306f\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002
a622=\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8(\u30df\u30ea\u79d2)
a622.help=\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u306e\u64cd\u4f5c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
a622.help.txt=\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u64cd\u4f5c\u306e\u30c0\u30a4\u30a2\u30ed\u30b0\u306e\u64cd\u4f5c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8 \u30df\u30ea\u79d2\u3067\u8a18\u8ff0\u3057\u307e\u3059\u3002 \
OpenAM\u306e\u8a8d\u8a3c\u753b\u9762\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304c\u512a\u5148\u3055\u308c\u308b\u305f\u3081\u3001\u521d\u671f\u50243\u5206(180000\u30df\u30ea\u79d2)\u4ee5\u4e0a\u3092\u8a2d\u5b9a\u3059\u308b\u969b\u306f\u672c\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u4ee5\u5916\u306e\u8a2d\u5b9a\u5909\u66f4\u304c\u5fc5\u8981\u3067\u3059\u3002
a623=Authenticator \u306e\u6700\u5927\u6570
a623.help=\u767b\u9332\u3067\u304d\u308b Authenticator \u306e\u6700\u5927\u6570
a623.help.txt=\u30e6\u30fc\u30b6\u30fc\u306f\u3053\u3053\u3067\u6307\u5b9a\u3057\u305f\u6570\u307e\u3067 Authenticator \u3092\u767b\u9332\u3067\u304d\u307e\u3059\u3002
a650=Display Name \u4fdd\u5b58\u5c5e\u6027\u540d
a650.help=Display Name \u304c\u4fdd\u5b58\u3055\u308c\u308b\u5c5e\u6027\u540d\u3067\u3059\u3002
a650.help.txt=Display Name\u306f\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u3067\u30e6\u30fc\u30b6\u30fc\u306e\u8b58\u5225\u60c5\u5831\u8ffd\u88dc\u3068\u3057\u3066\u8868\u793a\u3055\u308c\u308b\u6587\u5b57\u5217\u3067\u3059\u3002\u5024\u306f\u6587\u5b57\u5217\u3067\u3059\u3002\u4f8b cn

# exception messages
authFailed=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f
noUserFound=\u30e6\u30fc\u30b6\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
multipleUserFound=\u8907\u6570\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
userAttributeError=\u30e6\u30fc\u30b6\u30fc\u5c5e\u6027\u53d6\u5f97\u30a8\u30e9\u30fc\u3002
libraryError=\u5b9f\u88c5\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3067\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
invalidModuleState=\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u72b6\u614b\u304c\u4e0d\u6b63\u3067\u3059\u3002
noUserIdentified=\u30e6\u30fc\u30b6\u30fc\u3092\u7279\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
emptyCallback=WebAuthn HiddenCallback \u304c\u7a7a\u3067\u3059\u3002
jsonParseError=JSON \u30d1\u30fc\u30b9\u30a8\u30e9\u30fc\u3002
storeError=Autheticator \u306e\u4fdd\u5b58\u30a8\u30e9\u30fc\u3002
deviceServiceError=WebAuthn Autheticator \u30b5\u30fc\u30d3\u30b9\u3092\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u3067\u304d\u307e\u305b\u3093\u3002

# login error messages
msgRegCancel=\u30c7\u30d0\u30a4\u30b9\u306e\u767b\u9332\u304c\u30ad\u30e3\u30f3\u30bb\u30eb\u3055\u308c\u307e\u3057\u305f\u3002
msgRegMax=\u3053\u308c\u4ee5\u4e0a\u3001\u30c7\u30d0\u30a4\u30b9\u3092\u767b\u9332\u3067\u304d\u307e\u305b\u3093\u3002

