#
# The contents of this file are subject to the terms of the Common Development and
# Distribution License (the License). You may not use this file except in compliance with the
# License.
#
# You can obtain a copy of the License at legal/CDDLv1.0.txt. See the License for the
# specific language governing permission and limitations under the License.
#
# When distributing Covered Software, include this CDDL Header Notice in each file and include
# the License file at legal/CDDLv1.0.txt. If applicable, add the following below the CDDL
# Header, with the fields enclosed by brackets [] replaced by your own identifying
# information: "Portions copyright [year] [name of copyright owner]".
#
# Copyright 2019 Open Source Solution Technology Corporation
#

authentication=Authentication Modules

# Module name on console
iPlanetAMAuthSAML2ServiceDescription=SAML2

# Module settings
a500=\u8a8d\u8a3c\u30ec\u30d9\u30eb
a500.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a500.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
0(\u30c7\u30d5\u30a9\u30eb\u30c8)\u304c\u6700\u4f4e\u3067\u3059\u3002
a501=IdP \u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc ID
a501.help=\u3053\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u4f7f\u7528\u3059\u308b SAML2 IdP \u30b5\u30fc\u30d3\u30b9\u306e\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u540d (\u3053\u306e\u30ec\u30eb\u30e0\u5185\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059)\u3002
a502=SP \u306e MetaAlias
a502.help=\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e MetaAlias\u3002\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u5f62\u5f0f\u306f <pre>/realm_name/SP</pre> \u3067\u3059\u3002
a503=IdP \u306b NameID \u306e\u4f5c\u6210\u3092\u8a31\u53ef\u3059\u308b
a503.help=\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u306b\u8b58\u5225\u5b50\u304c\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u306b\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u304c\u65b0\u3057\u3044\u8b58\u5225\u5b50\u3092\u4f5c\u6210\u3067\u304d\u308b\u304b\u3069\u3046\u304b\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a504=\u9023\u4fc2\u3059\u308b\u8a8d\u8a3c\u9023\u9396
a504.help=\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ea\u30e2\u30fc\u30c8\u3067\u8a8d\u8a3c\u3055\u308c\u305f\u30a2\u30b5\u30fc\u30b7\u30e7\u30f3\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u3068\u4e00\u81f4\u3055\u305b\u308b\u305f\u3081\u306b\u30e6\u30fc\u30b6\u30fc\u3092\u30ed\u30fc\u30ab\u30eb\u3067\u8a8d\u8a3c\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u5834\u5408\u306b\u5b9f\u884c\u3055\u308c\u308b\u8a8d\u8a3c\u9023\u9396\u3002
a505=\u6bd4\u8f03\u30bf\u30a4\u30d7
a505.help=(\u30aa\u30d7\u30b7\u30e7\u30f3) \u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u8981\u6c42\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30af\u30e9\u30b9\u307e\u305f\u306f\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u8a55\u4fa1\u3059\u308b\u6bd4\u8f03\u65b9\u6cd5\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002OpenAM \u306f\u6b21\u306e\u5024\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059: <br/><br/>\
  <ul><li><code>better</code></li>\
  <li><code>exact</code></li>\
  <li><code>maximum</code></li>\
  <li><code>minimum</code></li></ul>
a506=\u8a8d\u8a3c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30af\u30e9\u30b9\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9
a506.help=(\u30aa\u30d7\u30b7\u30e7\u30f3) \u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u8a8d\u8a3c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u30af\u30e9\u30b9\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u3092\u6307\u5b9a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u8907\u6570\u306e\u5024\u306f\u30d1\u30a4\u30d7\u6587\u5b57 (|) \u3067\u533a\u5207\u308a\u307e\u3059\u3002
a507=\u8a8d\u8a3c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u5ba3\u8a00\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9
a507.help=(\u30aa\u30d7\u30b7\u30e7\u30f3) \u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u8a8d\u8a3c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u5ba3\u8a00\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u3092\u6307\u5b9a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u8907\u6570\u306e\u5024\u306f\u30d1\u30a4\u30d7\u6587\u5b57 (|) \u3067\u533a\u5207\u308a\u307e\u3059\u3002
a508=\u30ea\u30af\u30a8\u30b9\u30c8\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
a508.help=\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f SP \u304c IdP \u3068\u901a\u4fe1\u3059\u308b\u3068\u304d\u306b\u4f7f\u7528\u3059\u3079\u304d\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u6307\u5b9a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a509=\u30ec\u30b9\u30dd\u30f3\u30b9\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
a509.help=\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f IdP \u304c SP \u3068\u901a\u4fe1\u3059\u308b\u3068\u304d\u306b\u4f7f\u7528\u3059\u3079\u304d\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u6307\u5b9a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a510=IdP \u306e\u8a8d\u8a3c\u3092\u5f37\u5236\u3059\u308b
a510.help=\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u304c\u8a8d\u8a3c\u3092\u5f37\u5236\u3059\u308b\u304b\uff08true\uff09\u3001\u65e2\u5b58\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u518d\u5229\u7528\u3067\u304d\u308b\u304b\uff08false\uff09\u3092\u6307\u5b9a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a511=\u30d1\u30c3\u30b7\u30d6\u8a8d\u8a3c
a511.help=\u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u304c\u53d7\u52d5\u7684\u306b\u8a8d\u8a3c\u3059\u308b\uff08true\uff09\u304b\u3001\u8a8d\u8a3c\u3057\u306a\u3044\uff08false\uff09\u304b\u3092\u6307\u5b9a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a512=NameID \u30d5\u30a9\u30fc\u30de\u30c3\u30c8
a512.help=(\u30aa\u30d7\u30b7\u30e7\u30f3) \u3053\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u3001\u6b21\u306e\u3088\u3046\u306a SAML NameID \u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3092\u6307\u5b9a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
  <pre>urn:oasis:names:tc:SAML:2.0:nameid-format:persistent</pre> \
  <pre>urn:oasis:names:tc:SAML:2.0:nameid-format:transient</pre> \
  <pre>urn:oasis:names:tc:SAML:2.0:nameid-format:unspecified</pre>
a515=\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8\u3092\u6709\u52b9\u306b\u3059\u308b
a515.help=\u30bb\u30c3\u30b7\u30e7\u30f3\u30ed\u30b0\u30a2\u30a6\u30c8\u306e\u6642\u70b9\u3067\u30e6\u30fc\u30b6\u30fc\u306e IdP \u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u30ed\u30b0\u30a2\u30a6\u30c8\u3092\u8a66\u884c\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002\u3053\u306e SAML2 \u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u542b\u3080\u8a8d\u8a3c\u9023\u9396\u3067 <pre>org.forgerock.openam.authentication.modules.saml2.SAML2PostAuthenticationPlugin</pre> \u3092\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a516=\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8 URL
a516.help=\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306b IdP \u30ed\u30b0\u30a2\u30a6\u30c8\u304c\u6210\u529f\u3057\u305f\u5f8c\u306b\u30e6\u30fc\u30b6\u30fc\u304c\u8ee2\u9001\u3055\u308c\u308b URL \u3067\u3059\u3002\u3053\u308c\u306f\u5b8c\u5168\u4fee\u98fe URL (http \u3067\u59cb\u307e\u308b) \u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u305d\u3046\u3067\u306a\u3044\u5834\u5408\u3001\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306f\u6a5f\u80fd\u3057\u307e\u305b\u3093\u3002

# error messages
invalidLoginState=SAML2 \u30ed\u30b0\u30a4\u30f3\u4e2d\u306b\u4e88\u671f\u3057\u306a\u3044\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
samlLocalAuthFailed=\u30ed\u30fc\u30ab\u30eb\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u3082\u3046\u4e00\u5ea6\u3084\u308a\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
samlLocalConfigFailed=SAML2 \u8a2d\u5b9a\u306e\u30ed\u30fc\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
localLinkError=\u30ed\u30fc\u30ab\u30eb\u30e6\u30fc\u30b6\u30fc\u3092\u30ea\u30e2\u30fc\u30c8\u30e6\u30fc\u30b6\u30fc\u306b\u30de\u30c3\u30d4\u30f3\u30b0\u3067\u304d\u307e\u305b\u3093\u3002
samlFailoverError=SAML2 \u8a8d\u8a3c\u3092\u6a5f\u80fd\u3055\u305b\u308b\u306b\u306f\u3001SAML2 \u30d5\u30a7\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u3092\u6709\u52b9\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
badRequest=\u30d7\u30ed\u30ad\u30b7\u304c\u4e0d\u6b63\u306a\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002
missingCookie=\u30d7\u30ed\u30ad\u30b7\u306f\u671f\u5f85\u3059\u308b Cookie \u3092\u898b\u3064\u3051\u3089\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
missingMeta=\u30d7\u30ed\u30ad\u30b7\u306f\u30e1\u30bf\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3092\u898b\u3064\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
metaError=\u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u30a8\u30e9\u30fc\u304c\u3042\u308a\u307e\u3057\u305f\u3002
samlGet=\u30d7\u30ed\u30ad\u30b7\u306f SAML \u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u62bd\u51fa\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
samlVerify=\u30d7\u30ed\u30ad\u30b7\u306f\u30ec\u30b9\u30dd\u30f3\u30b9\u3092\u691c\u8a3c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
samlFailover=\u30d7\u30ed\u30ad\u30b7\u306f SAML2 \u30d5\u30a7\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u3092\u691c\u8a3c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
samlNullRequest=HTTP \u30ea\u30af\u30a8\u30b9\u30c8\u306a\u3057\u3067\u30ed\u30b0\u30a4\u30f3\u3067\u304d\u307e\u305b\u3093\u3002\u30d7\u30ed\u30b0\u30e9\u30e0\u306b\u3088\u308b\u30ed\u30b0\u30a4\u30f3\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

# items on console
HTTP-Redirect=HTTP-Redirect
HTTP-POST=HTTP-POST
HTTP-Artifact=HTTP-Artifact
Persistent=Persistent
Transient=Transient
Unspecified=Unspecified
true=true
false=false
exact=exact
better=better
maximum=maximum
minimum=minimum
