#
# The contents of this file are subject to the terms of the Common Development and
# Distribution License (the License). You may not use this file except in compliance with the
# License.
#
# You can obtain a copy of the License at legal/CDDLv1.0.txt. See the License for the
# specific language governing permission and limitations under the License.
#
# When distributing Covered Software, include this CDDL Header Notice in each file and include
# the License file at legal/CDDLv1.0.txt. If applicable, add the following below the CDDL
# Header, with the fields enclosed by brackets [] replaced by your own identifying
# information: "Portions Copyrighted [year] [name of copyright owner]".
#
# Copyright 2019 Open Source Solution Technology Corporation
#

openam-auth-webauthn-service-description=WebAuthn Authenticator \u30b5\u30fc\u30d3\u30b9

a100=Authenticator \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9
a100.help=Authenticator \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9
a100.help.txt=WebAuthn Authenticator \u3092\u4fdd\u5b58\u3059\u308b\u305f\u3081\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9
a101=Credential ID \u5c5e\u6027
a101.help=Credential ID \u304c\u4fdd\u5b58\u3055\u308c\u308b\u5c5e\u6027\u540d\u3067\u3059\u3002
a101.help.txt=\u4fdd\u5b58\u3055\u308c\u308b\u5024\u306f\u30d0\u30a4\u30ca\u30ea\u5024\u3092Base64Url\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u305f\u6587\u5b57\u5217\u3067\u3059\u3002
a102=\u516c\u958b\u9375\u5c5e\u6027
a102.help=\u516c\u958b\u9375\(COSEKey)u304c\u4fdd\u5b58\u3055\u308c\u308b\u5c5e\u6027\u540d\u3067\u3059\u3002
a102.help.txt=\u4fdd\u5b58\u3055\u308c\u308b\u5024\u306f\u30d0\u30a4\u30ca\u30ea\u3067\u3059\u3002
a103=Display Name \u5c5e\u6027
a103.help=Display Name \u304c\u4fdd\u5b58\u3055\u308c\u308b\u5c5e\u6027\u540d\u3067\u3059\u3002
a103.help.txt=Display Name\u306f\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u3067\u30e6\u30fc\u30b6\u30fc\u306e\u8b58\u5225\u60c5\u5831\u8ffd\u88dc\u3068\u3057\u3066\u8868\u793a\u3055\u308c\u308b\u6587\u5b57\u5217\u3067\u3059\u3002\u5024\u306f\u6587\u5b57\u5217\u3067\u3059\u3002
a104=\u30ab\u30a6\u30f3\u30bf\u30fc\u5c5e\u6027
a104.help=\u30ab\u30a6\u30f3\u30bf\u30fc \u4fdd\u5b58\u5c5e\u6027\u540d
a104.help.txt=\u8a8d\u8a3c\u30c7\u30d0\u30a4\u30b9\u306e\u7f72\u540d\u56de\u6570\u304c\u4fdd\u5b58\u3055\u308c\u308b\u5c5e\u6027\u540d\u3067\u3059\u3002

a200=\u30d7\u30e9\u30a4\u30de\u30ea LDAP \u30b5\u30fc\u30d0\u30fc
a200.help=Authenticator \u306e\u691c\u7d22\u306b\u4f7f\u7528\u3059\u308b\u30d7\u30e9\u30a4\u30de\u30ea LDAP \u30b5\u30fc\u30d0\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a200.help.txt=WebAuthn \u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u8a8d\u8a3c\u7528\u306e\u30d7\u30e9\u30a4\u30de\u30ea\u30b5\u30fc\u30d0\u30fc\u3068\u3057\u3066\u3053\u306e\u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\u5358\u4e00\u306e\u30a8\u30f3\u30c8\u30ea\u306f\u3001\u6b21\u306e\u5f62\u5f0f\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002:\
<br/><br/><code>LDAP \u30b5\u30fc\u30d0\u30fc:\u30dd\u30fc\u30c8</code><br/><br/>\u8907\u6570\u306e\u30a8\u30f3\u30c8\u30ea\u306b\u3088\u308a\u3001 OpenAM \u30b5\u30fc\u30d0\u30fc\u3068 LDAP \u30b5\u30fc\u30d0\u30fc\u9593\u306e\u9023\u643a\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002\
\u5f62\u5f0f\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059:<br/><br/><code>\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d | \u30b5\u30fc\u30d0\u30fc:\u30dd\u30fc\u30c8</code><br/><br/>\
\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30b5\u30a4\u30c8\u306e\u30ea\u30b9\u30c8\u306b\u3042\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u5b8c\u5168\u540d\u3067\u3059\u3002
a201=\u30bb\u30ab\u30f3\u30c0\u30ea LDAP \u30b5\u30fc\u30d0\u30fc
a201.help=Authenticator \u306e\u691c\u7d22\u306b\u4f7f\u7528\u3055\u308c\u308b\u30bb\u30ab\u30f3\u30c0\u30ea\uff08\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\uff09LDAP \u30b5\u30fc\u30d0\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a201.help.txt=\u30d7\u30e9\u30a4\u30de\u30ea LDAP \u30b5\u30fc\u30d0\u30fc\u306b\u969c\u5bb3\u304c\u767a\u751f\u3057\u305f\u5834\u5408\u3001 LDAP \u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30bb\u30ab\u30f3\u30c0\u30ea\u30b5\u30fc\u30d0\u30fc\u306b\u30d5\u30a7\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u3057\u307e\u3059\u3002\
\u5358\u4e00\u306e\u30a8\u30f3\u30c8\u30ea\u306f\u3001\u6b21\u306e\u5f62\u5f0f\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093:<br/><br/><code> LDAP \u30b5\u30fc\u30d0\u30fc:\u30dd\u30fc\u30c8</code><br/><br/>\
\u8907\u6570\u306e\u30a8\u30f3\u30c8\u30ea\u306b\u3088\u308a\u3001 OpenAM \u30b5\u30fc\u30d0\u30fc\u3068 LDAP \u30b5\u30fc\u30d0\u30fc\u9593\u306e\u9023\u643a\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002\
\u5f62\u5f0f\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059:<br/><br/><code>\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d | \u30b5\u30fc\u30d0\u30fc:\u30dd\u30fc\u30c8</code><br/><br/>\
<i>\u6ce8\u610f </i>\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30b5\u30a4\u30c8\u306e\u30ea\u30b9\u30c8\u306b\u3042\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u5b8c\u5168\u540d\u3067\u3059\u3002
a202=\u30d9\u30fc\u30b9 DN
a202.help=Authenticator \u306e\u30d9\u30fc\u30b9 DN \u3067\u3059\u3002
a202.help.txt=Authenticator \u306e\u691c\u7d22\u306f\u3001\u3053\u306e\u30d9\u30fc\u30b9 DN \u304b\u3089\u958b\u59cb\u3057\u307e\u3059\u3002
a203=\u30d0\u30a4\u30f3\u30c9\u30e6\u30fc\u30b6\u30fc DN
a203.help=WebAuthn \u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u304c LDAP \u30b5\u30fc\u30d0\u30fc\u3078\u306e\u8a8d\u8a3c\u306b\u4f7f\u7528\u3059\u308b\u30a2\u30ab\u30a6\u30f3\u30c8\u306e DN \u3067\u3059\u3002
a203.help.txt=WebAuthn \u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u306f\u3001\u8aad\u307f\u53d6\u308a\u304a\u3088\u3073\u66f8\u304d\u8fbc\u307f\u6a29\u9650\u3092\u6301\u3064\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u5fc5\u8981\u3067\u3059\u3002
a204=\u30d0\u30a4\u30f3\u30c9\u30e6\u30fc\u30b6\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9
a204.help=\u7ba1\u7406\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u307e\u3059\u3002
a205=LDAP \u63a5\u7d9a\u30e2\u30fc\u30c9
a205.help=LDAP \u30b5\u30fc\u30d0\u30fc\u3078\u306e\u63a5\u7d9a\u3092\u78ba\u7acb\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
a205.help.txt='LDAP' \u304c\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u63a5\u7d9a\u306f<b>\u4fdd\u8b77\u3055\u308c\u305a</b>\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u4e0a\u3067<b>\u5e73\u6587</b>\u3067\u8ee2\u9001\u3055\u308c\u307e\u3059\u3002<br/> \
'LDAPS' \u304c\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u63a5\u7d9a\u306f SSL \u307e\u305f\u306f TLS \u3067\u4fdd\u8b77\u3055\u308c\u307e\u3059\u3002<br/> \
'StartTLS' \u304c\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001StartTLS \u62e1\u5f35\u64cd\u4f5c\u3092\u4f7f\u7528\u3057\u3066\u63a5\u7d9a\u304c\u4fdd\u8b77\u3055\u308c\u307e\u3059\u3002
a2051=LDAP
a2052=LDAPS
a2053=StartTLS
a206=LDAPS \u30d7\u30ed\u30c8\u30b3\u30eb\u30d0\u30fc\u30b8\u30e7\u30f3
a206.help=LDAP \u30b5\u30fc\u30d0\u30fc\u3078\u306e\u5b89\u5168\u306a\u63a5\u7d9a\u3092\u78ba\u7acb\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30d7\u30ed\u30c8\u30b3\u30eb\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
a2061=TLSv1
a2062=TLSv1.1
a2063=TLSv1.2
a207=\u3059\u3079\u3066\u306e\u30b5\u30fc\u30d0\u30fc\u8a3c\u660e\u66f8\u3092\u4fe1\u983c\u3059\u308b
a207.help=\u3059\u3079\u3066\u306e\u8a3c\u660e\u66f8\u3092\u4fe1\u983c\u3059\u308b <code>X509TrustManager</code> \u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a207.help.txt=\u3053\u306e\u6a5f\u80fd\u306b\u3088\u308a\u3001 WebAuthn \u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u81ea\u5df1\u7f72\u540d\u8a3c\u660e\u66f8\u3084\u7121\u52b9\u306a\u8a3c\u660e\u66f8(\u7121\u52b9\u306a\u30db\u30b9\u30c8\u540d\u306a\u3069)\u306b\u3088\u3063\u3066\u4fdd\u8b77\u3055\u308c\u305f \
LDAP \u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3067\u304d\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u901a\u5e38\u306e\u8a3c\u660e\u66f8\u691c\u8a3c\u30d7\u30ed\u30bb\u30b9\u3092\u56de\u907f\u3059\u308b\u3088\u3046\u306b\u6ce8\u610f\u3057\u3066\u3053\u306e\u6a5f\u80fd\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a208=LDAP \u63a5\u7d9a\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u9593\u9694
a208.help=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306b OpenAM \u304c\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u8981\u6c42\u3092\u9001\u4fe1\u3059\u308b\u983b\u5ea6\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
a208.help.txt=\u3053\u306e\u8a2d\u5b9a\u306f\u3001 OpenAM \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306b\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u691c\u7d22\u8981\u6c42\u3092\u9001\u4fe1<b>\u3059\u3079\u304d</b>\u983b\u5ea6\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002 \
\u63a5\u7d9a\u304c\uff08\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30a8\u30e9\u30fc\u306a\u3069\u306b\u8d77\u56e0\u3057\u3066\uff09\u5fdc\u7b54\u3057\u306a\u304f\u306a\u3063\u305f\u5834\u5408\u3001\u554f\u984c\u304c\u691c\u51fa\u3055\u308c\u308b\u307e\u3067\u306b\u3053\u306e\u9593\u9694\u306e\u6642\u9593\u304c\u304b\u304b\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002 \
\u6b63\u78ba\u306a\u9593\u9694\u3092\u5b9a\u7fa9\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u6642\u9593\u5358\u4f4d\u30d1\u30e9\u30e1\u30fc\u30bf\u3068\u3068\u3082\u306b\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30bc\u30ed\u307e\u305f\u306f\u8ca0\u306e\u5024\u306f\u3001\
\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u8981\u6c42\u3092\u7121\u52b9\u306b\u3059\u308b\u3053\u3068\u306b\u306a\u308a\u307e\u3059\u3002
a209=LDAP \u63a5\u7d9a\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u6642\u9593\u5358\u4f4d
a209.help=\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u9593\u9694\u306e\u8a2d\u5b9a\u306b\u5bfe\u5fdc\u3059\u308b\u6642\u9593\u5358\u4f4d\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
a209.help.txt=\u3053\u306e\u8a2d\u5b9a\u306f\u3001 OpenAM \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306b\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u691c\u7d22\u8981\u6c42\u3092\u9001\u4fe1<b>\u3059\u3079\u304d</b>\u983b\u5ea6\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002 \
\u63a5\u7d9a\u304c\uff08\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30a8\u30e9\u30fc\u306a\u3069\u306b\u8d77\u56e0\u3057\u3066\uff09\u5fdc\u7b54\u3057\u306a\u304f\u306a\u3063\u305f\u5834\u5408\u3001\u554f\u984c\u304c\u691c\u51fa\u3055\u308c\u308b\u307e\u3067\u306b\u3053\u306e\u9593\u9694\u306e\u6642\u9593\u304c\u304b\u304b\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002 \
\u6b63\u78ba\u306a\u9593\u9694\u3092\u5b9a\u7fa9\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u9593\u9694\u30d1\u30e9\u30e1\u30fc\u30bf\u3068\u3068\u3082\u306b\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
a2091=\u79d2
a2092=\u5206
a2093=\u6642\u9593
a210=LDAP \u64cd\u4f5c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
a210.help=OpenAM \u304c\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306e\u5fdc\u7b54\u3092\u5f85\u3064\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u6642\u9593\u3092\u79d2\u5358\u4f4d\u3067\u5b9a\u7fa9\u3057\u307e\u3059 - 0 \u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u306a\u3044\u3053\u3068\u3092\u610f\u5473\u3057\u307e\u3059\u3002
a210.help.txt=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306e\u30db\u30b9\u30c8\u304c\u5b8c\u5168\u306b\u30c0\u30a6\u30f3\u3057\u3066\u3044\u308b\u304b TCP \u63a5\u7d9a\u304c\u7121\u52b9\u306b\u306a\u3063\u305f\u5834\u5408\u3001OS \u3084 JVM \u304b\u3089\u306e \
\u64cd\u4f5c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304c\u9069\u7528\u3055\u308c\u308b\u307e\u3067 OpenAM \u306f\u5f85\u6a5f\u3057\u307e\u3059\u3002 \u3057\u304b\u3057\u3001\u3053\u306e\u8a2d\u5b9a\u306f OpenAM \u81ea\u8eab\u306e\u4e2d\u3067\u3088\u308a\u7d30\u304b\u3044\u5236\u5fa1\u3092\u53ef\u80fd\u306b\u3057\u307e\u3059\u3002 \
\u5024 <code>0</code> \u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304c OpenAM \u306e\u30ec\u30d9\u30eb\u3067\u9069\u7528\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3068\u3001JVM \u3084 OS \u304b\u3089\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304c\u9069\u7528\u3055\u308c\u308b\u3053\u3068\u3092\u610f\u5473\u3057\u307e\u3059\u3002

i18nTrue=\u6709\u52b9
i18nFalse=\u7121\u52b9
