#
# The contents of this file are subject to the terms of the Common Development and
# Distribution License (the License). You may not use this file except in compliance with the
# License.
#
# You can obtain a copy of the License at legal/CDDLv1.0.txt. See the License for the
# specific language governing permission and limitations under the License.
#
# When distributing Covered Software, include this CDDL Header Notice in each file and include
# the License file at legal/CDDLv1.0.txt. If applicable, add the following below the CDDL
# Header, with the fields enclosed by brackets [] replaced by your own identifying
# information: "Portions copyright [year] [name of copyright owner]".
#
# Portions Copyrighted 2026 OSSTech Corporation
#

authchainswitch-service-description=\u8a8d\u8a3c\u9023\u9396\u5206\u5c90\u30e2\u30b8\u30e5\u30fc\u30eb(\u89aa)
a500=\u8a8d\u8a3c\u30ec\u30d9\u30eb
a500.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a501=\u8a8d\u8a3c\u9023\u9396\u3092\u5224\u5b9a\u3059\u308b\u5024\u304c\u5165\u308b\u5c5e\u6027\u540d
a501.help=\u3053\u3053\u3067\u6307\u5b9a\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u306e\u5c5e\u6027\u5024\u3092\u8a8d\u8a3c\u9023\u9396\u306e\u5224\u5b9a\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002
a502=\u5c5e\u6027\u304c\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u306b\u52d5\u4f5c\u3059\u308b\u8a8d\u8a3c\u9023\u9396
a502.help=\u30e6\u30fc\u30b6\u30fc\u306e\u5c5e\u6027\u304c\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u306f\u3053\u3053\u3067\u6307\u5b9a\u3055\u308c\u305f\u8a8d\u8a3c\u9023\u9396\u3067\u52d5\u4f5c\u3057\u307e\u3059\u3002
a502.help.txt=\u8a8d\u8a3c\u9023\u9396\u306b<code>[Empty]</code>\u3068\u6307\u5b9a\u3057\u305f\u5834\u5408\u306f\u3001\u8a8d\u8a3c\u9023\u9396\u3092\u547c\u3073\u51fa\u3055\u305a\u306b\u8a8d\u8a3c\u6210\u529f\u3068\u306a\u308a\u307e\u3059\u3002
a503=\u5c5e\u6027\u5024\u3068\u8a8d\u8a3c\u9023\u9396\u306e\u30de\u30c3\u30d7
a503.help=<code>\u30ad\u30fc</code>\u306b<code>\u5c5e\u6027\u5024</code>,  <code>\u5024</code>\u306b<code>\u8a8d\u8a3c\u9023\u9396</code>\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
a503.help.txt=\u8a8d\u8a3c\u9023\u9396\u306b<code>[Empty]</code>\u3068\u6307\u5b9a\u3057\u305f\u5834\u5408\u306f\u3001\u8a8d\u8a3c\u9023\u9396\u3092\u547c\u3073\u51fa\u3055\u305a\u306b\u8a8d\u8a3c\u6210\u529f\u3068\u306a\u308a\u307e\u3059\u3002
a504=\u30bb\u30c3\u30b7\u30e7\u30f3\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c8\u6642 [Empty] \u3067\u3082\u8a8d\u8a3c\u6210\u529f\u3068\u3059\u308b
a504.help=\u30bb\u30c3\u30b7\u30e7\u30f3\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c8\u6642\u306e\u307f\u306b\u4f7f\u7528\u3059\u308b\u8a2d\u5b9a\u9805\u76ee\u3067\u3059\u3002
a504.help.txt=<code>\u6709\u52b9</code>\u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c8\u6642\u306b<code>[Empty]</code>\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002<br> \
<code>\u7121\u52b9</code>\u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c8\u6642\u306b<code>[Empty]</code>\u306b\u3088\u308b\u8a8d\u8a3c\u304c\u8a31\u53ef\u3055\u308c\u305a\u3001<code>[Empty]</code>\u304c\u52d5\u4f5c\u3057\u305f\u5834\u5408\u306f\u8a8d\u8a3c\u30a8\u30e9\u30fc\u3068\u306a\u308a\u307e\u3059\u3002
a505=Cookie \u540d
a505.help=\u9078\u629e\u753b\u9762\u3067\u9078\u3093\u3060\u8a8d\u8a3c\u65b9\u5f0f\u3092\u4fdd\u5b58\u3059\u308b Cookie \u306e\u540d\u524d\u3068\u3057\u3066\u4f7f\u7528\u3057\u307e\u3059\u3002
a505.help.txt=\u4fdd\u5b58\u3057\u305f Cookie \u306f\u6b21\u306b\u9078\u629e\u753b\u9762\u3092\u8868\u793a\u3057\u305f\u969b\u3001\u4ee5\u524d\u9078\u629e\u3057\u305f\u8a8d\u8a3c\u65b9\u5f0f\u3092\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u9078\u629e\u72b6\u614b\u3068\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002
a506=Cookie \u306e\u6709\u52b9\u671f\u9650
a506.help=\u4fdd\u5b58\u3059\u308b Cookie \u306e\u6709\u52b9\u671f\u9650\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
a506.help.txt=\u5358\u4f4d\u306f\u65e5\u6570\u3067\u3059\u3002<code>0</code>\u3092\u8a2d\u5b9a\u3057\u305f\u5834\u5408\u306f Cookie \u3092\u767a\u884c\u3057\u307e\u305b\u3093\u3002
a507=\u300c\u5c5e\u6027\u5024\u3068\u8a8d\u8a3c\u9023\u9396\u306e\u30de\u30c3\u30d7\u300d\u306b\u7121\u3044\u5c5e\u6027\u5024\u3092\u6301\u3064\u30e6\u30fc\u30b6\u30fc\u306f\u8a8d\u8a3c\u30a8\u30e9\u30fc\u3068\u3059\u308b
a507.help=\u30e6\u30fc\u30b6\u30fc\u306e\u5c5e\u6027\u5024\u306b\u300c\u5c5e\u6027\u5024\u3068\u8a8d\u8a3c\u9023\u9396\u306e\u30de\u30c3\u30d7\u300d\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u306a\u3044\u5024\u304c\u4e00\u3064\u3067\u3082\u5b58\u5728\u3057\u305f\u5834\u5408\u306e\u52d5\u4f5c\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
a507.help.txt=<code>\u6709\u52b9</code>\u306f\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u306a\u3044\u5024\u304c\u5b58\u5728\u3059\u308b\u3068\u8a8d\u8a3c\u30a8\u30e9\u30fc\u3068\u306a\u308a\u307e\u3059\u3002<br>\
<code>\u7121\u52b9</code>\u306f\u8a8d\u8a3c\u30a8\u30e9\u30fc\u3068\u305b\u305a\u3001\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u306a\u3044\u5024\u3092\u7121\u8996\u3057\u3066\u51e6\u7406\u3092\u7d99\u7d9a\u3057\u307e\u3059\u3002

choiceprompt=\u4e00\u89a7\u304b\u3089\u8a8d\u8a3c\u65b9\u5f0f\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
OK=\u8ffd\u52a0\u306e\u8a8d\u8a3c\u3092\u3057\u306a\u3044
HOTP=\u767b\u9332\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306b\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u901a\u77e5
DATASTORE=ID/\u30d1\u30b9\u30ef\u30fc\u30c9
LDAP=ID/\u30d1\u30b9\u30ef\u30fc\u30c9
OATH=Authenticator\u306e\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9

NullRequest=\u30ea\u30af\u30a8\u30b9\u30c8\u5185\u5bb9\u304c\u4e0d\u6b63\u3067\u3059\u3002
localAuthChainError=\u8a8d\u8a3c\u9023\u9396\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
invalidLoginState=\u30ed\u30b0\u30a4\u30f3\u30b9\u30c6\u30fc\u30c8\u95a2\u9023\u306e\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
localAuthFailed=\u30ed\u30fc\u30ab\u30eb\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
SettingError=\u8a2d\u5b9a\u5024\u304c\u4e0d\u6b63\u3067\u3059\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
authFailed=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
sessionUpgradeError=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u8ffd\u52a0\u306e\u8a8d\u8a3c\u3092\u884c\u3046\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
